<a href="https://colab.research.google.com/github/ramsoi53/ramsoi/blob/main/ML_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os
os.chdir('/content/drive/MyDrive/Colab Notebooks/files')

# Project Practice - Kaggle's Titanic competition
Detailed Time Schedule

*   Import files and check files - 2022.04.04 
*   Check nulls and deal with them - 2022.04.04
*   Data Preprocessing
    - Set up the logic
    - Visulaization
    - Check Outliners and deal with it  - 2022.04.04

In [3]:
# Import necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Import and read files

train = pd.read_csv('ttn_train.csv')
test = pd.read_csv('tn_test.csv')
display(train.head(), test.head())

In [9]:
# shape of each data

print('train data:', train.shape, 'test data:', test.shape)

train data: (891, 12) test data: (418, 11)

In [ ]:
# info of each data
print('train data:', train.info(), 'test data:', test.info())
print()
train.isnull().sum()
print()
test.isnull().sum()

#Findings from above


1.   There are null vales in Age & Cabin categories.
2.   Dtypes of 5 categories are object which needs to be converted to either int or float

In [15]:
# Let's see how each data looks like
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Things to do on 0404
1. Find insights, corr and etc through Visualization.
2. From the result of 1, set up logics and guiding principles for the project.